// Вбудована функція setTimeout використовує колбек-функції. 
// Створіть альтернативу яка базується на промісах.  
// Функція delay(ms) повинна повертати проміс, який перейде в стан resolved через ms мілісекунд, так щоб ми могли додати до нього .then:
function delay(ms) {
    return new Promise((resolve) => {
        setTimeout(resolve, ms)
    });
  } 
 
  delay(3000).then(() => alert('виконалось через 3 секунди'));


//   Напишіть функцію, яка повертає проміс, який виконується через певний час (наприклад, 2 секунди) 
//   і повертає повідомлення "Проміс виконано".

function promise() {
    return new Promise(() => {
        setTimeout(() => {
            resolve("hello")
        })
    })
}